app/controllers/school_classes_controller.rb

  def create
    @schoolclass = SchoolClass.create(form_details)
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Computer Science"], ["room_number", 5], ["created_at", "2016-08-19 18:50:43.480931"], ["updated_at", "2016-08-19 18:50:43.480931"]]

  def update
    # binding.pry
    @schoolclass.update(form_details)
---
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2016-08-19 20:06:37.088030"], ["id", 1]]

  def set_id
    @schoolclass = SchoolClass.find(params[:id])
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]