app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2016-08-19 20:23:45.799122"], ["updated_at", "2016-08-19 20:23:45.799122"]]
---
  def create
    # binding.pry
    @student = Student.create(form_details)

UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2016-08-19 20:23:46.082522"], ["id", 1]]
---
  def update
    @student.update(form_details)

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
---
  def set_id
    @student = Student.find(params[:id])